---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
source: html/01111e24-6322-9724-8670-3250e48e7a47.htm
---
# AnalyticalSurfaceBase Properties

This represents the Analyze As parameter assigned to Analytical Element.